Revit 2024 API
FilledRegionType.IsValidFillPatternId Method
 Check if the id is a FillPatternElement or an invalidElementId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool IsValidFillPatternId(
	ElementId patternId
)
Visual Basic
Public Function IsValidFillPatternId ( _
	patternId As ElementId _
) As Boolean
Visual C++
public:
bool IsValidFillPatternId(
	ElementId^ patternId
)
Parameters
patternId
Type: Autodesk.Revit.DB.ElementId
 Element id of the FillPatternElement
Return Value
 True if the id is InvalidElementId, or if the element is a FillPatternElement. False otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace